<a href="https://colab.research.google.com/github/madahetooo/hatDetector/blob/master/Fraud_Detection_Challenge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
!cp "drive/My Drive/zindi/train.zip" train.zip
!cp "drive/My Drive/zindi/test.zip" test.zip

In [ ]:
!unzip train.zip
!unzip test.zip

Archive:  train.zip
replace client_train.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: client_train.csv
replace invoice_train.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: invoice_train.csv
Archive:  test.zip
replace client_test.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: client_test.csv
replace invoice_test.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: y
  inflating: invoice_test.csv

In [ ]:
import numpy as np
import pandas as pd
import datetime
import gc
import matplotlib.pyplot as plt
import seaborn as sns
import lightgbm as lgb
from sklearn.model_selection import StratifiedKFold
from sklearn.metrics import mean_squared_error
import warnings
warnings.filterwarnings('ignore')
np.random.seed(4590)

In [ ]:
train_client=pd.read_csv('/content/client_train.csv')
test_client=pd.read_csv('/content/client_test.csv')
train_invoice=pd.read_csv('/content/invoice_train.csv')
test_invoice=pd.read_csv('/content/invoice_test.csv')

sub=pd.read_csv('drive/My Drive/SampleSubmission.csv')

In [ ]:
train_client.head()

   disrict          client_id  client_catg  region creation_date  target
0       60     train_Client_0           11     101    31/12/1994     0.0
1       69     train_Client_1           11     107    29/05/2002     0.0
2       62    train_Client_10           11     301    13/03/1986     0.0
3       69   train_Client_100           11     105    11/07/1996     0.0
4       62  train_Client_1000           11     303    14/10/2014     0.0

In [ ]:
train_invoice.head(10)

        client_id invoice_date  ...  months_number  counter_type
0  train_Client_0   2014-03-24  ...              4          ELEC
1  train_Client_0   2013-03-29  ...              4          ELEC
2  train_Client_0   2015-03-23  ...              4          ELEC
3  train_Client_0   2015-07-13  ...              4          ELEC
4  train_Client_0   2016-11-17  ...             12          ELEC
5  train_Client_0   2017-07-17  ...              8          ELEC
6  train_Client_0   2018-12-07  ...             12          ELEC
7  train_Client_0   2019-03-19  ...              8          ELEC
8  train_Client_0   2011-07-22  ...              4          ELEC
9  train_Client_0   2011-11-22  ...              4          ELEC

[10 rows x 16 columns]

In [ ]:
d={"ELEC":0,"GAZ":1}
train_invoice['counter_type']=train_invoice['counter_type'].map(d)

In [ ]:
train_client['client_catg'] = train_client['client_catg'].astype('object')
train_client['disrict'] = train_client['disrict'].astype('object')

test_client['client_catg'] = test_client['client_catg'].astype('object')
test_client['disrict'] = test_client['disrict'].astype('object')

In [ ]:
train_invoice['counter_type'].value_counts()

0    3079406
1    1397343
Name: counter_type, dtype: int64

In [ ]:
for df in [train_invoice,test_invoice]:
    df['invoice_date'] = pd.to_datetime(df['invoice_date'])

In [ ]:
aggs = {}
aggs['consommation_level_1'] = ['mean']
aggs['consommation_level_2'] = ['mean']
aggs['consommation_level_3'] = ['mean']
aggs['consommation_level_4'] = ['mean']

In [ ]:
agg_trans = train_invoice.groupby(['client_id']).agg(aggs)
agg_trans.columns = ['_'.join(col).strip() for col in agg_trans.columns.values]
agg_trans.reset_index(inplace=True)

df = (train_invoice.groupby('client_id')
          .size()
          .reset_index(name='{}transactions_count'.format('1')))

agg_trans = pd.merge(df, agg_trans, on='client_id', how='left')

In [ ]:
agg_trans.head()

           client_id  ...  consommation_level_4_mean
0     train_Client_0  ...                   0.000000
1     train_Client_1  ...                   0.000000
2    train_Client_10  ...                   0.000000
3   train_Client_100  ...                   0.000000
4  train_Client_1000  ...                  36.714286

[5 rows x 6 columns]

In [ ]:
train = pd.merge(train_client,agg_trans, on='client_id', how='left')

In [ ]:
test_client.head()

  disrict         client_id client_catg  region creation_date
0      62     test_Client_0          11     307    28/05/2002
1      69     test_Client_1          11     103    06/08/2009
2      62    test_Client_10          11     310    07/04/2004
3      60   test_Client_100          11     101    08/10/1992
4      62  test_Client_1000          11     301    21/07/1977

In [ ]:
test_invoice.head()

       client_id invoice_date  ...  months_number  counter_type
0  test_Client_0   2018-03-16  ...              8          ELEC
1  test_Client_0   2014-03-21  ...              8          ELEC
2  test_Client_0   2014-07-17  ...              4          ELEC
3  test_Client_0   2015-07-13  ...              4          ELEC
4  test_Client_0   2016-07-19  ...              4          ELEC

[5 rows x 16 columns]

In [ ]:
d={"ELEC":0,"GAZ":1}
test_invoice['counter_type']=test_invoice['counter_type'].map(d)

In [ ]:
agg_trans = test_invoice.groupby(['client_id']).agg(aggs)
agg_trans.columns = ['_'.join(col).strip() for col in agg_trans.columns.values]
agg_trans.reset_index(inplace=True)

df = (test_invoice.groupby('client_id')
          .size()
          .reset_index(name='{}transactions_count'.format('1')))

agg_trans = pd.merge(df, agg_trans, on='client_id', how='left')

In [ ]:
test = pd.merge(test_client,agg_trans, on='client_id', how='left')

In [ ]:
train.head()

  disrict  ... consommation_level_4_mean
0      60  ...                  0.000000
1      69  ...                  0.000000
2      62  ...                  0.000000
3      69  ...                  0.000000
4      62  ...                 36.714286

[5 rows x 11 columns]

In [ ]:
test.head()

  disrict  ... consommation_level_4_mean
0      62  ...                  0.000000
1      69  ...                586.318182
2      62  ...                  0.162162
3      60  ...                  0.000000
4      62  ...                  0.000000

[5 rows x 10 columns]

In [ ]:
train.shape,test.shape

((135493, 11), (58069, 10))

In [ ]:
for df in [train,test]:
    df['creation_date'] = pd.to_datetime(df['creation_date'])

In [ ]:
train.columns

Index(['disrict', 'client_id', 'client_catg', 'region', 'creation_date',
       'target', '1transactions_count', 'consommation_level_1_mean',
       'consommation_level_2_mean', 'consommation_level_3_mean',
       'consommation_level_4_mean'],
      dtype='object')

In [ ]:
col_to_drop = ['client_id', 'creation_date']
for col in col_to_drop:
    if col in train.columns:
        train.drop([col], axis=1, inplace=True)
    if col in test.columns:
        test.drop([col], axis=1, inplace=True)

In [ ]:
from sklearn import preprocessing
for f in test.columns:
    if train[f].dtype=='object' or test[f].dtype=='object': 
        lbl = preprocessing.LabelEncoder()
        lbl.fit(list(train[f].values) + list(test[f].values))
        train[f] = lbl.transform(list(train[f].values))
        test[f] = lbl.transform(list(test[f].values))

In [ ]:
all_data_na = train.isnull().sum() 
all_data_na = all_data_na.drop(all_data_na[all_data_na == 0].index).sort_values(ascending=False)[:30]
missing_data = pd.DataFrame({'Missing ' :all_data_na})
missing_data.head(20)

Empty DataFrame
Columns: [Missing ]
Index: []

In [ ]:
target=train['target']
train.drop('target',axis=1,inplace=True)

In [ ]:
from sklearn.ensemble import AdaBoostClassifier
m = AdaBoostClassifier(n_estimators=50000 , learning_rate = 0.01)
m.fit(train,target)
pr = m.predict_proba(test)
pr = pd.DataFrame(pr)

pr.head()
sub = pd.DataFrame({"client_id": sub["client_id"] , "target" : pr[1] })
sub.to_csv('subbb4.csv' , index = False)

In [ ]:
sub.head()

          client_id    target
0     test_Client_0  0.957281
1     test_Client_1  0.996425
2    test_Client_10  0.612359
3   test_Client_100  0.776933
4  test_Client_1000  0.571046